session_3/blogspot/app/controllers/articles_controller.rb

UPDATE "users" SET "updated_at" = ?, "private_access" = ? WHERE "users"."id" = ?  [["updated_at", "2021-02-02 12:02:03.254640"], ["private_access", 2], ["id", 1]]
---
  def show
    if current_user
      if can? :show, @article, user_id:current_user.id
        @im = true
      end
      if can? :update, @article, user_id: current_user.id
        @goodboy = true;
      end
      if !@article.public
        session[:private_access] -= 1
        current_user.private_access -= 1
        current_user.save

INSERT INTO "articles" ("title", "tags", "topic", "content", "created_at", "updated_at", "user_id", "public") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    if current_user
      @article = Article.new(article_params)
      @article.user_id = current_user.id
      if @article.save