session_3/blogspot/app/controllers/articles_controller.rb

  def index
    @articles = Article.last(5)
    if current_user
      @articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 5]]
SELECT "articles".* FROM "articles" LIMIT ?  [["LIMIT", 11]]

  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id

    if @article.save
---
INSERT INTO "articles" ("title", "tags", "topic", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)