session_3/blogspot/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "private_access") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.private_access = 5
    respond_to do |format|
      if @user.save